<!DOCTYPE html>

<html>
  <head>
    <title>The Rise of LeRak</title>
    <meta charset="UTF-8">
    <link rel="icon" type="image/x-icon" href="ci/Icon_LeRak_Done.png">
    <link rel="stylesheet" type="text/css" href="main.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Inter|Inter&effect=fire|neon|outline|emboss|shadow-multiple|Philosopher|Philosopher&effect=fire|neon|outline|emboss|shadow-multiple">
    <script src="https://code.jquery.com/jquery-3.2.0.min.js"></script>
  </head>
  <body>
    <script src="script.js"></script>

    <ul id = "navigation_bar">
      <li><a href = "index.html"><img class="logo" src="ci/Logo_Weiss.png" width="100"></img></a></li>
      <li><a class = "navigation_link" href = "development.html">Entstehung</a></li>
      <li><a class = "navigation_link" href = "magic.html">Magiesystem</a></li>
      <li><a class = "navigation_link selected_tab" href = "characters.html">Charaktere</a></li>
      <li><a class = "navigation_link" href = "team.html">Team</a></li>
      <li><a class = "navigation_link" href = "news.html">Neuigkeiten</a></li>
      <li><img class="instagram-logo" src="ci/Instagram_Glyph_Gradient.png" width="25"></img></li>
      <li><a target="_blank" rel="noopener noreferrer" href = "https://www.instagram.com/theriseoflerak"><img class="lerak" src="ci/LeRak.png" width="100"></img></a></li>
    </ul>
    
    <h1>Charaktere</h1>
    
    <h2>LeRak</h2> 
        <h3>Namensfindung</h3>
        <p>Um ein Duell gegen einen computergesteuerten Gegner zu erstellen, brauchte es zun&auml;chst eben diesen Gegner. 
            Die &Uuml;berlegungen, wie der Antagonist von &bdquo;The Rise of LeRak&ldquo; hei&szlig;en und handeln soll, 
            starteten gleich zu Beginn der Projektphase. 
            Hierbei profitierten wir besonders von unserem Ansatz, alle Ideen immer zu notieren. 
            Einer der ersten Einf&auml;lle beruhte n&auml;mlich auf dem Roboter &bdquo;Karel&ldquo;, 
            der bereits im Jahr 1970 durch einen Absolventen der Stanford University, Richard Pattis, erdacht wurde. 
            Im Jahr 2005 wurde Karel dann, nachdem der Computer-Science-Kurs der Stanford University zu Java wechselte, 
            f&uuml;r Java und Eclipse neu geschrieben und implementiert. 
            Dies wurde in dem Buch &bdquo;Karel the Robot learns Java&ldquo; von Eric Roberts 
            aus dem Department of Computer Science der Stanford University festgehalten, 
            um Studierenden der Universit&auml;t das Programmieren von Grund mit einem spielerischen Ansatz nahezubringen. 
            Karel ist n&auml;mlich ein einfacher Roboter, der auf einem Gitternetz lebt und einfache Befehle ausf&uuml;hren kann.</p>

        <p>Unser Professor f&uuml;r Programmieren I und jetzt der Betreuer dieses Projekts, Prof. Dr. Ralph Lano, 
            hat diesen Ansatz f&uuml;r seine Vorlesung aufgegriffen und verwendet ebenfalls Karel, 
            um seinen Studierenden Java beizubringen.</p>

        <p>Da sich Karel einer allgemeinen Beliebtheit erfreut, und das im Besonderen bei den Mitgliedern dieses Projektteams, 
            war die Entscheidung, Karel in unserem Spiel unterzubringen, schnell gefallen. So war &bdquo;LeRak&ldquo;
             geboren, gedacht als ein b&ouml;ser Gegenspieler zu Karel. Diese Parallele ist an LeRaks Namen ersichtlich, 
             denn &bdquo;Karel&ldquo; wird zu &bdquo;leraK&ldquo;, wenn Karel in umgekehrter Reihenfolge geschrieben wird.</p>

        <h3>Design</h3>
        <p>Die Idee f&uuml;r das Aussehen von LeRak basiert auf Karel, dem Maskottchen f&uuml;r Java von Standford University. 
            Er beruht auch noch auf dem erstenMacintosh von Apple, welches in den achtziger Jahren erschienen ist. 
            Dies war die Grundlage f&uuml;r die dreidimensionale Version von LeRak. 
            Die Inspiration f&uuml;r das vermenschlichte Aussehen der Hauptfigur stammt von Susan Kares ersten Mac-Icons, 
            welches auch in den Achtziger erschienen ist. Aber um etwas mehr in die Spielrichtung zu gehen,
            wurden ein paar Elemente aus den Cartoons entnommen und in sein Design eingef&uuml;gt. 
            F&uuml;r den ersten Designentwurf von LeRak war es wichtig gewesen, nicht dieselben Konzepte zu nehmen, 
            die Apple oder Stanford University verwendet haben.</p>
            
        <p>Es wurden mehrere Skizzen von LeRak erstellt, die an verschiedenen Stellen abgeschnittene Ecken haben 
            und runde oder eckige Kanten besitzen. Eine weitere Idee war ihm eine Tasche zu geben, 
            die entweder seitlich von seiner Schulter h&auml;ngt oder wie ein Utility G&uuml;rtel um ihn herum h&auml;ngt. 
            Die Taschen sollen den Zweck haben, dass LeRak seine &#8222;Beeper&ldquo; &auml;hnlichen Objekten dort aufbewahren kann. 
            Da der Entwurf mit dem G&uuml;rtel und dem Cartoon-Style von LeRak eine &Auml;hnlichkeit 
            mit einer schon bekannten Spielfigur hat, war die Entscheidung eindeutig bei keiner Tasche gewesen. 
            Um einen Copyright-Strike zu vermeiden, war es ebenfalls besser, sie zu entfernen.</p>

        <p>Im Gegensatz zu Susan Kares Icons besteht LeRaks Gesicht aus Dot-Matrizen 
            und der Mund wurde gr&ouml;&szlig;tenteils durch einen Schnurrbart ersetzt. Um die B&ouml;sewicht-Stimmung, 
            aber auch Vermenschlichung zu erschaffen, wurden die H&auml;nde und Beine in einem auf dem fr&uuml;hen 
            bis Mitte des zwanzigsten Jahrhundert basierenden Cartoon-Style gezeichnet. 
            Die Inspirationen daf&uuml;r waren amerikanische schwarz-wei&szlig; Cartoons 
            aus den 1930er-Jahren und das Spiel &#8222;Cuphead&ldquo; aus dem Jahr 2017, 
            welches sich auch vom alten Zeichenstil inspirieren lassen lie&szlig;. 
            Das Resultat von den &Uuml;berlegungen und Entw&uuml;rfen fiel auf einen LeRak mit einer oben rechts geschnittenen Ecke, 
            abgerundete Kanten und ohne Taschen.</p>

    <h2>Forschis</h2> 
        <p>Die Forschis sind hochprofessionelle forschende und auf gar keinen Fall eigentlich Studis!</p>
        <p>About, Forschi-Blog</p>
    <h2>_̷̧̨̫͎̫̝̯̝̬̾̀̌̉̽̚͠_̷̪͍̬͇͈̼̘͆̓̋́̌͆͘_̶̛̭̳̱̟̭͈̗̺̝̒͆͊͂͜_̷̯̲̼̒̎͘_̶͕̬̑̂̈́̈́_̴̡̜̩͈͓͇̼͙̱̄͂͗̃͗͑̎̏̕͠ͅ_̶̢̢̙̟̖̥͌̂̕͝_̵̲̫͎̣̜͓̗͐_̶̨͈̟͌̽̉͘_̴̗̱̠̄̈́̈́/<h2> 
        <p>ARG?</p>
  </body>
</html>