<!DOCTYPE html>

<html>
  <head>
    <title>The Rise of LeRak</title>
    <meta charset="UTF-8">
    <link rel="icon" type="image/x-icon" href="ci/Icon_LeRak_Done.png">
    <link rel="stylesheet" type="text/css" href="main.css">
    <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Inter|Inter&effect=fire|neon|outline|emboss|shadow-multiple|Philosopher|Philosopher&effect=fire|neon|outline|emboss|shadow-multiple">
    <script src="https://code.jquery.com/jquery-3.2.0.min.js"></script>
  </head>
  <body>
    <script src="script.js"></script>

    <ul id = "navigation_bar">
        <li><a href = "index.html"><img class="logo" src="ci/Logo_Weiss.png" width="100"></img></a></li>
        <li><a class = "navigation_link selected_tab" href = "development.html">Entstehung</a></li>
        <li><a class = "navigation_link" href = "magic.html">Magiesystem</a></li>
        <li><a class = "navigation_link" href = "characters.html">Charaktere</a></li>
        <li><a class = "navigation_link" href = "team.html">Team</a></li>
        <li><a class = "navigation_link" href = "news.html">Neuigkeiten</a></li>
        <li><img class="instagram-logo" src="ci/Instagram_Glyph_Gradient.png" width="25"></img></li>
        <li><a target="_blank" rel="noopener noreferrer" href = "https://www.instagram.com/theriseoflerak"><img class="lerak" src="ci/LeRak.png" width="100"></img></a></li>
    </ul>

    <h1>Entstehung der Projekt-Idee</h1>
        <p>&bdquo;The Rise of LeRak&ldquo; ist eines von neun Projekten, 
            die die Studierenden des Studiengangs Media Engineering an der Technischen Hochschule 
            N&uuml;rnberg Georg Simon Ohm w&auml;hrend ihres f&uuml;nften und sechsten Semesters in Teams verwirklichen. 
            Dabei werden sie von einem oder mehreren Professoren beziehungsweise Dozierenden betreut, 
            welche bei der technischen und formalen Umsetzung der Projekte Unterst&uuml;tzung leisten. 
            Die Projektarbeit stellt dabei den zentralen H&ouml;hepunkt des gesamten Studiums dar und ist die umfangreichste Arbeit, 
            die die Studierenden des Media-Engineering-Studiengangs in ihrer Zeit im Studium durchf&uuml;hren. 
            &bdquo;The Rise of LeRak&ldquo; ist das einzige Projekt, das von Studierenden selbst vorgeschlagen wurde 
            und jetzt zus&auml;tzlich zu den Professoren vorgegebenen Themenvorschl&auml;gen umgesetzt wird. 
            Dieses Projekt hat das Ziel, ein interaktives Spiel in der Virtuellen Realit&auml;t umzusetzen. 
            Wenn sie das VR-Headset aufsetzen, sollen Personen eine Version der Hochschule erleben, 
            in der ein scheinbar b&ouml;ser Roboter w&uuml;tet. Es gilt, diesen Roboter, 
            genannt &bdquo;LeRak&ldquo;, zu besiegen. 
            Dazu lernen die Spielenden, wie sie dank Gestensteuerung Glyphen zeichnen k&ouml;nnen. 
            Mit diesen l&ouml;sen sie Zauber aus, mit denen sie sich mit ihrem Gegner duellieren k&ouml;nnen. 
            Dieser greift allerdings ebenfalls mit seiner Glyphenmagie an.</p>
        
        <p>Die Hauptmotivation hinter &#8222;The Rise of LeRak&ldquo; ist es grunds&auml;tzlich, 
            im Rahmen des f&uuml;nften und sechsten Semesters im Studiengangs Media Engineering ein Projekt umzusetzen. 
            Als selbstinitiiertes Projekt ist hier allerdings zus&auml;tzlich die Motivation hinter der eigenen Themenwahl interessant. 
            Die Entscheidung, ein eigenes Projektthema vorzuschlagen, r&uuml;hrte daher, 
            dass keiner der gegebenen Themenvorschl&auml;ge Virtual Reality zur Basis hatte. 
            Das Thema VR ist ein spannender, sich stets weiterentwickelnder Fachbereich im Gebiet Media Engineering. 
            Da sich alle Mitglieder dieses Projektteams daf&uuml;r begeistern und auch teils bereits Erfahrungen mit VR 
            im Rahmen des Praktikumssemesters gesammelt hatten, wurde begonnen, 
            ein Projektthema mit der Grundlage Virtual Reality zu konzipieren. 
            Es wurden dabei verschiedene M&ouml;glichkeiten ausgelotet, da VR eine gro&szlig;e Bandbreite an Anwendungsf&auml;llen hat. 
            Das Interesse der Teammitglieder am Game Design f&uuml;hrte bald zu einer Konzentration auf diesen Bereich. 
            Das Projekt sollte also ein VR-Spiel werden. Die entscheidende Idee bot hier das Projekt im Fach Interaktion 
            des dritten Semesters. Dort wurde unter anderem ein 3D-gedruckter Zauberstab gefertigt, 
            der mittels Gestenerkennung einer Infrarot-LED verschiedene Zauberspr&uuml;che erkennen sollte. 
            Die M&ouml;glichkeiten, diese Idee auszubauen, wurden von diesem Projektteam in der Planungsphase aufgegriffen. 
            Besonders der Einfall, den Zauberstab mit Gestenerkennung in einem Duell zu verwenden, r&uuml;ckte dabei in den Fokus. 
            Alternativ gab es die &Uuml;berlegung, eine erkundbare Umgebung zu schaffen. 
            Von Anfang an war dabei das BB Geb&auml;ude der Technischen Hochschule N&uuml;rnberg 
            als Austragungsort in der virtuellen Realit&auml;t im Fokus. Aufgrund der Schwierigkeit, 
            Navigation im Raum in VR umzusetzen, fiel die Entscheidung letztlich auf die Umsetzung eines Duells 
            gegen einen computergesteuerten Gegner.</p>
        
        <p>Der Fokus auf Magie und Zauberei als Rahmen war durch den Zauberstab als Grundlage bereits gegeben. 
            N&auml;her eingeschr&auml;nkt wurde dieser Rahmen im Verlauf der Konzeptionierung auf ein Fantasy-Setting 
            mit Bezug zu moderner Technologie.
            Damit soll die Br&uuml;cke zwischen dem Projekt im technischen Studiengang Media Engineering 
            an einer Technischen Hochschule zur Fantasy-Thematik der Zauberei geschlagen werden. 
            Letztendlich wurde sich darauf geeinigt, ein Zauberduell gegen einen Gegner in der Virtuellen Realit&auml;t zu entwickeln, 
            worin Spielende mithilfe von Gesten Zauber ausl&ouml;sen k&ouml;nnen. 
            Die Zauber sollen dabei in Form von Glyphen dargestellt werden, die mit dem VR-Controller gezeichnet werden.</p>


    </body>
</html>